Show / Hide Table of Contents
Class ColumnData
Column data base
Inheritance
System.Object
ColumnData
ColumnDataEc2
Inherited Members
 System.Object.ToString()
 System.Object.Equals(System.Object)
 System.Object.Equals(System.Object, System.Object)
 System.Object.ReferenceEquals(System.Object, System.Object)
 System.Object.GetHashCode()
 System.Object.GetType()
 System.Object.MemberwiseClone()
Namespace: IdeaRS.OpenModel.Concrete
Assembly: IdeaRS.OpenModel.dll
Syntax
public abstract class ColumnData
Constructors
Improve this Doc   View Source
ColumnData()
Constructor
Declaration
public ColumnData()
Properties
Improve this Doc   View Source
CalculateY
Gets an indication, whether imperfections and second order have to be performed perpendicular to the y axis.
Declaration
public bool CalculateY { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
CalculateZ
Gets an indication, whether imperfections and second order have to be performed perpendicular to the z axis.
Declaration
public bool CalculateZ { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
EffectiveLength
Gets or sets type of input effective length
Declaration
public InputValue EffectiveLength { get; set; }
Property Value
 Type |  Description
 InputValue
Improve this Doc   View Source
FemL0Y
effective length calculated in FEM for Y direction
Declaration
public double FemL0Y { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FemL0Z
effective length calculated in FEM for Z direction
Declaration
public double FemL0Z { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
FemLenghtFromFlexibleSupport
true if FEM length were calculated from flexible supports
Declaration
public bool FemLenghtFromFlexibleSupport { get; set; }
Property Value
 Type |  Description
 System.Boolean
Improve this Doc   View Source
ImperfectionDirection
Gets or sets the direction of imperfection.
Declaration
public ImperfectionDirection ImperfectionDirection { get; set; }
Property Value
 Type |  Description
 ImperfectionDirection
Improve this Doc   View Source
ImperfectionsInput
Indicates, whether use user values or calculate effect of imperfections.
Declaration
public InputValue ImperfectionsInput { get; set; }
Property Value
 Type |  Description
 InputValue
Improve this Doc   View Source
L
Gets or sets the system length of column.
Declaration
public double L { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
L0Y
Gets or sets the user defined effective length of column for Y direction. If is not defined, the must be valid support data.
Declaration
public double L0Y { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
L0Z
Gets or sets the user defined effective length of column for Z direction.
Declaration
public double L0Z { get; set; }
Property Value
 Type |  Description
 System.Double
Improve this Doc   View Source
SecondOrderEffectInput
Indicates, whether use user values or calculate 2'nd order effect.
Declaration
public InputValue SecondOrderEffectInput { get; set; }
Property Value
 Type |  Description
 InputValue
Improve this Doc   View Source
SupportBottomY
Gets or sets the end support. Not necessary if effective lengths are defined.
Declaration
public SupportType SupportBottomY { get; set; }
Property Value
 Type |  Description
 SupportType
Improve this Doc   View Source
SupportBottomZ
Gets or sets the end support. Not necessary if effective lengths are defined.
Declaration
public SupportType SupportBottomZ { get; set; }
Property Value
 Type |  Description
 SupportType
Improve this Doc   View Source
SupportTopY
Gets or sets the end support. Not necessary if effective lengths are defined.
Declaration
public SupportType SupportTopY { get; set; }
Property Value
 Type |  Description
 SupportType
Improve this Doc   View Source
SupportTopZ
Gets or sets the end support. Not necessary if effective lengths are defined.
Declaration
public SupportType SupportTopZ { get; set; }
Property Value
 Type |  Description
 SupportType
 Improve this Doc
 View Source